//Задача 4: Напишите программу, которая принимает на вход три числа и
// выдаёт максимальное из этих чисел.
//2, 3, 7 -> 7
//44 5 78 -> 78
//22 3 9 -> 22

Console.WriteLine("Введите первое число число: ");
string a = Console.ReadLine();
int intA = Convert.ToInt32(a);

Console.WriteLine("Введите второе число число: ");
string b = Console.ReadLine();
int intB = Convert.ToInt32(b);
Console.WriteLine("Введите третье число число: ");
string с = Console.ReadLine();
int intС = Convert.ToInt32(с);

if(intB > max)
{
    intB = max;
}
else
{
    intC > max
}

