// Задача 41: Пользователь вводит с клавиатуры M чисел. 
// Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

int[] array = new int[];

int FillArray(int[] arr)
{
    int m = 5;
    int count = 0;
    while(count < m)
    {
        Console.WriteLine("Введите число: ");
        int num = Convert.
    }
}
